In [1]:
import pandas as pd

In [2]:
# get the data
df = pd.read_csv("titanic.csv")

In [3]:
# check out the data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# remove the passenger id
df = df.drop(columns="PassengerId")

In [5]:
# get the titles from Name
title = list()
for name in df["Name"]:
    name = name.split(" ")
    for item in name:
        if "." in item:
            title.append(item)
            break
df["Title"] = title
df = df.drop(columns="Name")

In [6]:
# get the first character from Ticket
ticket = list()
for item in df["Ticket"]:
    ticket.append(item[0])
df["Ticket"] = ticket

In [7]:
# replace missing values in Cabin and Embarked with None
df["Cabin"] = df["Cabin"].fillna("None")
df["Embarked"] = df["Embarked"].fillna("None")

In [8]:
# get the first character from Cabin
cabin = list()
for item in df["Cabin"]:
    cabin.append(item[0])
df["Cabin"] = cabin

In [9]:
# shuffle the data
df = df.sample(frac=1, random_state=0).reset_index(drop=True)

In [10]:
# check out the data
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,NaN,0,0,2,14.4583,N,C,Mr.
1,0,3,male,NaN,0,0,S,7.5500,N,S,Mr.
2,0,3,male,7.0,4,1,3,29.1250,N,Q,Master.
3,1,1,female,NaN,1,0,P,146.5208,B,C,Mrs.
4,1,3,female,29.0,0,2,2,15.2458,N,C,Mrs.

In [11]:
# export the data
df.to_csv("survival.csv", index=False)